app/controllers/properties_controller.rb

  def show
    id = params[:id] # retrieve movie ID from URI route
    @property = Property.find(id)
---
SELECT  "properties".* FROM "properties" WHERE "properties"."id" = ? LIMIT 1  [["id", 1]]

  def index
    @properties = Property.all
---
SELECT "properties".* FROM "properties"