app/controllers/users_controller.rb

  def index
    @users = User.all  # Return all Users
---
SELECT "users".* FROM "users"

  def create
    if User.find_by_email(user_params[:email])!=nil
      flash[:notice] = "Sorry, this user-email is taken. Try again."
      redirect_to new_user_path, :method=>:get
    else
      @user = User.create_user!(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT 1  [["email", "gvwarrior@gmail.com"]]
INSERT INTO "users" ("user_id", "email", "session_token", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", "132"], ["email", "123"], ["session_token", "cpZ/LhuhLNs/eSrHPrJzZw=="], ["created_at", "2019-11-22 17:56:46.070715"], ["updated_at", "2019-11-22 17:56:46.070715"]]